perf/root.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    node3:
      target: 'http://localhost:5555/node3/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node3"
    gunicorn:
      target: 'http://localhost:5555/gunicorn/'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 120
      arrivalRate: 30
#    - name: Ramp
#      duration: 30
#      arrivalRate: 5 #(requests/second)
#      rampTo: 30

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'